#+TODO: TODO DOSUB BLOCKED | DONE CANCELED 
#+PROPERTY: Confidence_ALL 0 10 25 50 75 90 100
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 15:00 20:00 25:00 30:00 35:00 40:00
#+PROPERTY: Work_ALL 0 1 2 3 5 8 13 20 50 100
#+PROPERTY: Value_ALL 0 1 2 3 5 8 13 20 50 100
# Time Estimation column view
#+COLUMNS: %40ITEM(Task) %10Confidence(Confidence){mean} %17Effort(Estimated Effort){:} %CLOCKSUM
# WSJF column view for editing
# #+COLUMNS: %Value(Value)  %Work(Work) %ITEM(Task) %TODO(State) 
#+STARTUP: overview

* DOSUB Time Align Mobile
  :LOGBOOK:
  CLOCK: [2020-02-05 Wed 18:45]--[2020-02-05 Wed 19:13] =>  0:28
  CLOCK: [2019-12-17 Tue 21:22]--[2019-12-17 Tue 21:33] =>  0:11
  CLOCK: [2019-12-17 Tue 20:07]--[2019-12-17 Tue 21:22] =>  1:15
  CLOCK: [2019-11-12 Tue 20:55]--[2019-11-12 Tue 21:08] =>  0:13
  CLOCK: [2019-11-12 Tue 19:30]--[2019-11-12 Tue 20:49] =>  1:19
  CLOCK: [2019-09-29 Sun 17:17]--[2019-09-29 Sun 17:24] =>  0:07
  CLOCK: [2019-09-29 Sun 15:52]--[2019-09-29 Sun 15:55] =>  0:03
  CLOCK: [2019-09-15 Sun 11:20]--[2019-09-15 Sun 11:29] =>  0:09
  CLOCK: [2019-09-06 Fri 22:29]--[2019-09-06 Fri 22:36] =>  0:07
  CLOCK: [2019-08-11 Sun 19:08]--[2019-08-11 Sun 19:17] =>  0:09
  CLOCK: [2019-08-10 Sat 12:51]--[2019-08-10 Sat 13:11] =>  0:20
  CLOCK: [2019-07-20 Sat 21:52]--[2019-07-20 Sat 22:10] =>  0:18
  CLOCK: [2019-07-20 Sat 18:55]--[2019-07-20 Sat 18:56] =>  0:01
  CLOCK: [2019-07-13 Sat 18:20]--[2019-07-13 Sat 18:42] =>  0:22
  CLOCK: [2019-06-29 Sat 18:06]--[2019-06-29 Sat 18:10] =>  0:04
  CLOCK: [2019-06-17 Mon 17:42]--[2019-06-17 Mon 18:14] =>  0:32
  CLOCK: [2019-05-09 Thu 20:30]--[2019-05-09 Thu 20:55] =>  0:25
  CLOCK: [2018-09-21 Fri 07:39]--[2018-09-21 Fri 07:40] =>  0:01
  CLOCK: [2018-08-29 Wed 14:41]--[2018-08-29 Wed 14:46] =>  0:05
  CLOCK: [2018-08-19 Sun 16:05]--[2018-08-19 Sun 16:09] =>  0:04
  CLOCK: [2018-08-19 Sun 15:56]--[2018-08-19 Sun 16:05] =>  0:09
  CLOCK: [2018-08-18 Sat 15:07]--[2018-08-18 Sat 15:11] =>  0:04
  CLOCK: [2018-07-17 Tue 18:58]--[2018-07-17 Tue 19:17] =>  0:19
  :END:
     #+NAME: WSJF table
     #+BEGIN: propview :conds ((string= TODO "TODO")) :cols ((concat "[[" ITEM "]]") (/ (float VALUE) (float WORK)) VALUE WORK )
     | (concat "[[" ITEM "]]")                                                                        | (/ (float VALUE) (float WORK)) | VALUE | WORK |
     |--------------------------------------------------------------------------------------------+--------------------------------+-------+------|
     | "[[Notifications (local)]]"                                                                    |                            4.0 |    20 |    5 |
     | "[[Add prescribed handler tests]]"                                                             |                            2.6 |    13 |    5 |
     | "[[Add subscription tests]]"                                                                   |                            2.6 |    13 |    5 |
     | "[[Add selected start stop indicators (now indicator style)]]"                                 |                            2.5 |     5 |    2 |
     | "[[Multiple play timers]]"                                                                     |                            1.6 |     8 |    5 |
     | "[[Minor fixes]]"                                                                              |                              0 |     0 |    0 |
     | "[[Make a better report]]"                                                                     |                              0 |     0 |    0 |
     | "[[Display comp doesn't fit on some narrow screens]]"                                          |                              0 |     0 |    0 |
     | "[[Resolve differences between display references and code symbols]]"                          |                              0 |     0 |    0 |
     | "[[Explore ways to make theme switcher]]"                                                      |                              0 |     0 |    0 |
     | "[[Fix time comp for negative or over 24 hour values for template start/stop]]"                |                              0 |     0 |    0 |
     | "[[Figure out why creating a pattern with a period >24 hours defaults to 45 minute duration]]" |                              0 |     0 |    0 |
     | "[[CSV export]]"                                                                               |                              0 |     0 |    0 |
     | "[[Add Calendar integration]]"                                                                 |                              0 |     0 |    0 |
     | "[[Add payment option to vote for features]]"                                                  |                              0 |     0 |    0 |
     | "[[Add geofencing triggers on buckets]]"                                                       |                              0 |     0 |    0 |
     | "[[Add locked period mechanism]]"                                                              |                              0 |     0 |    0 |
     | "[[Mobile friendly data editor]]"                                                              |                              0 |     0 |    0 |
     | "[[Checklists]]"                                                                               |                              0 |     0 |    0 |
     | "[[Markov chain prediction]]"                                                                  |                              0 |     0 |    0 |
     | "[[Queue page]]"                                                                               |                              0 |     0 |    0 |
     | "[[Add queue definition to app-db]]"                                                           |                              0 |     0 |    0 |
     | "[[Add queue form]]"                                                                           |                              0 |     0 |    0 |
     | "[[Add queue list]]"                                                                           |                              0 |     0 |    0 |
     | "[[Add conversion to planned period function]]"                                                |                              0 |     0 |    0 |
     | "[[Calendar Page]]"                                                                            |                              0 |     0 |    0 |
     | "[[Optional offline analytics]]"                                                               |                              0 |     0 |    0 |
     | "[[Unpin react svg lib version]]"                                                              |                              0 |     0 |    0 |
     | "[[Handle time zone changes]]"                                                                 |                              0 |     0 |    0 |
     | "[[Refactor names]]"                                                                           |                              0 |     0 |    0 |
     | "[[Look into siri shortcuts with expo]]"                                                       |                              0 |     0 |    0 |
     | "[[Use react-native-router-flux]]"                                                             |                              0 |     0 |    0 |
     |--------------------------------------------------------------------------------------------+--------------------------------+-------+------|
     |                                                                                            |                                |       |      |
     #+END:
     #+begin_center
     This table uses a condition to filter the parent and children headings into a table displaying *VALUE* and *WORK* properties.
     The *(/ (float VALUE) (float WORK))* column is derived from those two properties. 
     ~C-c C-c~ on the table definition line to re-render.
     Sort by putting cursor on one of the lines and running ~org-table-sort-lines~ with *N* option.
     To rapidly enter *VALUE* and *WORK* properties use ~org-columns~ to enter column view.
     Then use arrow keys to navigate cells in column view. 
     Use ~SHIFT ->~ to cycle through property values.
     #+end_center
** DOSUB Release to friends [4/7]
*** DONE Put version indicator in app-db (for export mostly)
    CLOSED: [2020-01-12 Sun 16:53]
    :PROPERTIES:
    :VALUE:    1
    :WORK:     1
    :CONFIDENCE: 90
    :EFFORT:   0:30
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-12 Sun 16:33]--[2020-01-12 Sun 16:53] =>  0:20
    :END:
*** DONE Follow material design on each page without changing functionality [/]
    CLOSED: [2020-01-12 Sun 16:33]
    :PROPERTIES:
    :COOKIE_DATA: checkbox
    :WORK:     20
    :VALUE:    100
    :CONFIDENCE: 25
    :EFFORT:   10:00
    :ID:       22f1a641-8ec9-4456-9dbd-ca54e5ed162e
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-28 Thu 13:51]--[2019-11-28 Thu 13:54] =>  0:03
    CLOCK: [2019-11-13 Wed 20:56]--[2019-11-13 Wed 21:04] =>  0:08
    :END:
**** DONE Bucket list
     CLOSED: [2019-11-28 Thu 12:43]
     :LOGBOOK:
     CLOCK: [2019-11-28 Thu 12:10]--[2019-11-28 Thu 12:32] =>  0:22
     CLOCK: [2019-11-25 Mon 19:08]--[2019-11-25 Mon 19:08] =>  0:00
     CLOCK: [2019-11-24 Sun 17:27]--[2019-11-24 Sun 17:29] =>  0:02
     CLOCK: [2019-11-24 Sun 11:22]--[2019-11-24 Sun 12:42] =>  1:20
     CLOCK: [2019-11-24 Sun 09:23]--[2019-11-24 Sun 10:30] =>  1:07
     :END:
     +Between white, black, and lightened/darkened version of a color, there be a satisfying option for a [[https://www.npmjs.com/package/color#luminosity][contrast]] of 4.5 (WCAG minimum for readability).+
     +The list page could be a two line list with background a text color related to the bucket color. No icon on the left but a vertical three dot menu on the right.+
     Simple two line list with a vertical three dot menu on the right and a =google-circles-communities= icon that is colored by the bucket color.
     - [X] Bucket item uses list-item
     - [X] Bucket modal has close button
     - [X] Buckets screen has top bar
     - [X] Remove filters
     - [X] Change bottom sheet save to not close bottom sheet
     - [X] FAB exists on bucket list page
**** DONE Drawer [4/4]
     CLOSED: [2020-01-12 Sun 14:04]
     :LOGBOOK:
     CLOCK: [2020-01-12 Sun 14:02]--[2020-01-12 Sun 14:04] =>  0:02
     CLOCK: [2019-11-28 Thu 13:01]--[2019-11-28 Thu 13:18] =>  0:17
     :END:
     - [X] Minimum love-able screens displayed
     - [X] Icons are /better/
     - [X] Labels are /better/
     - [X] Swipe open is disabled (every screen needs top-bar)
**** DONE Plans
     CLOSED: [2019-11-30 Sat 17:24]
     :LOGBOOK:
     CLOCK: [2019-11-28 Thu 13:21]--[2019-11-28 Thu 13:51] =>  0:30
     :END:
     - [X] Uses similar item component as bucket
     - [X] Has default label text
     - [X] Has top bar
**** DONE Reports [4/4]
     CLOSED: [2020-01-09 Thu 17:37]
     :LOGBOOK:
     CLOCK: [2020-01-10 Fri 20:50]--[2020-01-10 Fri 21:26] =>  0:36
     CLOCK: [2020-01-09 Thu 17:09]--[2020-01-09 Thu 17:37] =>  0:28
     CLOCK: [2020-01-08 Wed 20:48]--[2020-01-08 Wed 21:03] =>  0:15
     CLOCK: [2020-01-06 Mon 19:59]--[2020-01-06 Mon 20:44] =>  0:45
     CLOCK: [2020-01-05 Sun 19:06]--[2020-01-05 Sun 20:27] =>  1:21
     CLOCK: [2020-01-05 Sun 19:03]--[2020-01-05 Sun 19:03] =>  0:00
     CLOCK: [2019-12-15 Sun 12:24]--[2019-12-15 Sun 13:30] =>  1:06
     CLOCK: [2019-12-14 Sat 19:38]--[2019-12-14 Sat 20:25] =>  0:47
     CLOCK: [2019-12-14 Sat 16:37]--[2019-12-14 Sat 17:38] =>  1:01
     CLOCK: [2019-12-14 Sat 14:27]--[2019-12-14 Sat 14:42] =>  0:15
     CLOCK: [2019-12-10 Tue 21:30]--[2019-12-10 Tue 21:48] =>  0:18
     CLOCK: [2019-12-10 Tue 20:14]--[2019-12-10 Tue 20:35] =>  0:21
     CLOCK: [2019-12-09 Mon 19:04]--[2019-12-09 Mon 21:30] =>  2:26
     CLOCK: [2019-12-09 Mon 12:30]--[2019-12-09 Mon 13:05] =>  0:35
     CLOCK: [2019-12-09 Mon 09:36]--[2019-12-09 Mon 10:40] =>  1:04
     CLOCK: [2019-12-08 Sun 13:57]--[2019-12-08 Sun 15:15] =>  1:18
     CLOCK: [2019-12-08 Sun 11:53]--[2019-12-08 Sun 13:56] =>  2:03
     CLOCK: [2019-12-01 Sun 18:22]--[2019-12-01 Sun 20:45] =>  2:23
     CLOCK: [2019-12-01 Sun 17:51]--[2019-12-01 Sun 18:00] =>  0:09
     CLOCK: [2019-12-01 Sun 17:34]--[2019-12-01 Sun 17:40] =>  0:06
     CLOCK: [2019-12-01 Sun 16:28]--[2019-12-01 Sun 17:23] =>  0:55
     CLOCK: [2019-12-01 Sun 16:18]--[2019-12-01 Sun 16:27] =>  0:09
     CLOCK: [2019-12-01 Sun 16:18]--[2019-12-01 Sun 16:18] =>  0:00
     CLOCK: [2019-12-01 Sun 15:42]--[2019-12-01 Sun 15:45] =>  0:03
     CLOCK: [2019-12-01 Sun 14:01]--[2019-12-01 Sun 14:37] =>  0:36
     :END:
     - [X] Has top bar
     - [X] Some chart (leaning on cumulative by bucket)
       - Pie chart seems like the best bet
       - Went with a line chart showing actual and planned total logged times for the past seven days
     - [X] A chart of scores based on a mapping of all 1440 minutes in a day
       - [X] Reset labels and styles
     - [X] Chart is tolerable
       - [X] Move the subscription logic to a handler that populates a value in state
       - [X] Set the subscription to read from that state value
       - [X] Display a refresh scores button that runs the handler
       - [X] Starts at zero
**** DONE Data 
     CLOSED: [2019-12-18 Wed 21:04]
     :PROPERTIES:
     :ID:       f8da7517-9f9b-49b2-8663-d3dc376f5df9
     :END:
     :LOGBOOK:
     CLOCK: [2019-12-18 Wed 20:16]--[2019-12-18 Wed 21:04] =>  0:48
     :END:
     - [X] Has top bar
     - [X] Uses better buttons
**** DONE Bucket form 
     CLOSED: [2019-12-21 Sat 20:26]
     :PROPERTIES:
     :ID:       fab82be7-e571-426d-9eb4-804db72e427c
     :END:
     :LOGBOOK:
     CLOCK: [2019-12-21 Sat 20:04]--[2019-12-21 Sat 20:20] =>  0:16
     CLOCK: [2019-12-21 Sat 16:50]--[2019-12-21 Sat 16:56] =>  0:06
     CLOCK: [2019-12-21 Sat 15:27]--[2019-12-21 Sat 16:41] =>  1:14
     CLOCK: [2019-12-21 Sat 13:51]--[2019-12-21 Sat 14:22] =>  0:31
     :END:
     - [X] Has top bar
     - [X] All components align
     - [X] All components have a consistent style
     - [X] Form on surface
**** DONE Period form 
     CLOSED: [2019-12-22 Sun 18:10]
     :LOGBOOK:
     CLOCK: [2019-12-22 Sun 17:27]--[2019-12-22 Sun 18:10] =>  0:43
     :END:
     - [X] Has top bar
     - [X] All components align
     - [X] All components have a consistent style
     - [X] Form on surface
     - [X] Fix where bottom sheet wasn't closing on drawer toggle
**** DONE Pattern form 
     CLOSED: [2020-01-01 Wed 17:08]
     :LOGBOOK:
     CLOCK: [2020-01-01 Wed 16:32]--[2020-01-01 Wed 17:08] =>  0:36
     CLOCK: [2020-01-01 Wed 15:22]--[2020-01-01 Wed 15:28] =>  0:06
     :END:
     - [X] Has top bar
     - [X] All components align
     - [X] All components have a consistent style
     - [X] Form on surface
**** DONE Pattern planning [4/4]
     CLOSED: [2020-01-05 Sun 16:39]
     :LOGBOOK:
     CLOCK: [2020-01-05 Sun 16:20]--[2020-01-05 Sun 16:39] =>  0:19
     CLOCK: [2020-01-05 Sun 15:22]--[2020-01-05 Sun 15:44] =>  0:22
     CLOCK: [2020-01-05 Sun 14:30]--[2020-01-05 Sun 15:21] =>  0:51
     CLOCK: [2020-01-04 Sat 18:21]--[2020-01-04 Sat 19:44] =>  1:23
     CLOCK: [2020-01-04 Sat 17:45]--[2020-01-04 Sat 18:16] =>  0:31
     CLOCK: [2020-01-04 Sat 16:23]--[2020-01-04 Sat 16:57] =>  0:34
     :END:
     - [X] Has top bar
     - [X] Has zoom options
     - [X] Plan save button is prominent
     - [X] Bottom sheet matches day planning in style
**** DONE Template form [2/2]
     CLOSED: [2020-01-10 Fri 21:44]
     :LOGBOOK:
     CLOCK: [2020-01-10 Fri 21:26]--[2020-01-10 Fri 21:44] =>  0:18
     CLOCK: [2020-01-05 Sun 19:02]--[2020-01-05 Sun 19:02] =>  0:00
     :END:
     - [X] Has top bar
     - [X] Realized this screen can be removed
**** DONE Switch to dark theme [3/3]
     CLOSED: [2020-01-12 Sun 14:02]
     :LOGBOOK:
     CLOCK: [2020-01-12 Sun 12:55]--[2020-01-12 Sun 14:02] =>  1:07
     CLOCK: [2020-01-12 Sun 12:34]--[2020-01-12 Sun 12:53] =>  0:19
     CLOCK: [2020-01-12 Sun 12:11]--[2020-01-12 Sun 12:29] =>  0:18
     CLOCK: [2020-01-11 Sat 22:20]--[2020-01-11 Sat 22:26] =>  0:06
     CLOCK: [2020-01-11 Sat 19:25]--[2020-01-11 Sat 19:33] =>  0:08
     CLOCK: [2020-01-11 Sat 17:11]--[2020-01-11 Sat 18:12] =>  1:01
     CLOCK: [2020-01-11 Sat 16:59]--[2020-01-11 Sat 17:09] =>  0:10
     CLOCK: [2020-01-11 Sat 16:51]--[2020-01-11 Sat 16:52] =>  0:01
     CLOCK: [2019-12-21 Sat 20:20]--[2019-12-21 Sat 20:26] =>  0:06
     :END:
     - [X] Import dark theme
     - [X] Switch custom colors
     - [X] +Set up a settings page and a single toggle+
       - [X] Attempted to put a toggle in app-db
       - [X] Chose a light or dark theme based on state at the provider level of component tree
       - [X] Realized there was a bunch of theme usages outside of the provider/component tree theme object
       - [X] Tried to refactor all of those usages to call a function and provide the /mode/ from state
         - [X] It got too ugly
**** DONE Misc along the way [11/11]
     CLOSED: [2020-01-12 Sun 14:53]
     :LOGBOOK:
     CLOCK: [2020-01-12 Sun 14:10]--[2020-01-12 Sun 14:53] =>  0:43
     CLOCK: [2019-12-01 Sun 12:26]--[2019-12-01 Sun 13:38] =>  1:12
     CLOCK: [2019-11-30 Sat 19:09]--[2019-11-30 Sat 19:09] =>  0:00
     CLOCK: [2019-11-30 Sat 17:24]--[2019-11-30 Sat 17:28] =>  0:04
     :END:
     - [X] Save closes keyboard
     - [X] Save ticks for in play update
     - [X] Tick updates the stop time in the form?
     - [X] Update back button
     - [X] Icons on Day FAB
     - [X] Play selects period and jumps to "now"
     - [X] Drawer does not user surface comp and background is theme background
     - [X] Remove menu close on zoom actions
     - [X] +Selecting next/prev also _jumps to_ (somehow)+
       - [X] Too hard to try right now
     - [X] +Get duration comp to line up properly for full form+
       - [X] See if this is actually an issue later
     - [X] Change display references for patterns to "templates"
       
*** DONE Add amplitude analytics [5/5]
    CLOSED: [2020-01-12 Sun 16:33]
    :PROPERTIES:
    :ID:       27160311-6918-44e2-a603-3d8679e903af
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-12 Sun 16:53]--[2020-01-12 Sun 17:15] =>  0:22
    CLOCK: [2020-01-12 Sun 16:18]--[2020-01-12 Sun 16:33] =>  0:15
    CLOCK: [2020-01-12 Sun 15:15]--[2020-01-12 Sun 16:17] =>  1:02
    CLOCK: [2020-01-05 Sun 21:00]--[2020-01-05 Sun 21:28] =>  0:28
    CLOCK: [2020-01-05 Sun 16:00]--[2020-01-05 Sun 16:18] =>  0:18
    :END:
    - [X] Amplitude account and project are set up
    - [X] Amplitude api key is injected into app +(12 factor style)+
    - [X] App initializes with api key
    - [X] Interceptor logs every handler event
    - [X] Does not log in development
**** Notes 
    *Do not commit key*
    Write a wrapper around publishing that looks for an envvar and stops publishing if it doesn't exist.
    Or [[https://github.com/expo/expo/issues/83#issuecomment-286559774][add an ignored js file]] with a tracked example version. Maybe the example version has a "no-ga" value.
    https://docs.expo.io/versions/latest/sdk/amplitude/
    https://amplitude.com/signup?ref=pricing-top-free
*** DONE Minor fixes [11/11]
    CLOSED: [2020-02-09 Sun 16:21]
    :LOGBOOK:
    CLOCK: [2020-02-09 Sun 16:15]--[2020-02-09 Sun 16:21] =>  0:06
    CLOCK: [2020-02-09 Sun 15:06]--[2020-02-09 Sun 16:15] =>  1:09
    CLOCK: [2020-02-09 Sun 14:59]--[2020-02-09 Sun 15:05] =>  0:06
    CLOCK: [2020-02-09 Sun 10:46]--[2020-02-09 Sun 11:20] =>  0:34
    CLOCK: [2020-02-08 Sat 17:46]--[2020-02-08 Sat 18:29] =>  0:43
    CLOCK: [2020-02-08 Sat 17:32]--[2020-02-08 Sat 17:45] =>  0:13
    CLOCK: [2020-02-08 Sat 17:26]--[2020-02-08 Sat 17:31] =>  0:05
    CLOCK: [2020-02-08 Sat 17:21]--[2020-02-08 Sat 17:26] =>  0:05
    CLOCK: [2020-02-08 Sat 16:34]--[2020-02-08 Sat 16:50] =>  0:16
    CLOCK: [2020-02-08 Sat 12:56]--[2020-02-08 Sat 14:07] =>  1:11
    CLOCK: [2020-02-08 Sat 11:42]--[2020-02-08 Sat 12:55] =>  1:13
    CLOCK: [2020-02-08 Sat 11:20]--[2020-02-08 Sat 11:41] =>  0:21
    CLOCK: [2020-02-08 Sat 11:09]--[2020-02-08 Sat 11:19] =>  0:10
    CLOCK: [2020-01-16 Thu 20:24]--[2020-01-16 Thu 20:38] =>  0:14
    CLOCK: [2020-01-16 Thu 18:51]--[2020-01-16 Thu 20:24] =>  1:33
    :END:
    - [X] Pattern form and list verbage
    - [X] Pattern modal isn't colored correctly
    - [X] +Tighten up+ Fix scroll-to race condition
    - [X] Play button from bottom sheet should also select the period it starts playing
    - [X] Bottom sheet should have rounded corners [[https://github.com/osdnk/react-native-reanimated-bottom-sheet#props][using border radius prop]]
    - [X] Change line graph to a contribution graph
    - [X] When opening the app after selecting a period the bottom sheet isn't open and only opening the menu will deselect the period (fix might be to deselect on app init?)
    - [X] Figure out why botton presses require longer touch period on the bottom sheet
    - [X] Tapping on templates doesn't select
    - [X] Remove button borders
    - [X] +Changing bucket, saving, and attempting to close the bottom sheet crashes the app+
      - Could not re-create in the emulator or on the device
      - It is weird that the period changes opacity like the ~render-collision~ does not detect it as selected
      - I have no idea why that is happening
*** TODO Make a better report
    :PROPERTIES:
    :ID:       4024a25a-895f-47a9-9bf9-1bb4d61e5a2a
    :END:
**** Better scoring algorithm
    - Did the time go where you wanted it
      - Segment periods by day
        - Cut off overlapping bits by duplication
      - Calculate totals per group id and get ratios of planned to actual
      - Accumulate ratios
    - Did the things happen when you wanted
      - Find any over lapping actual periods for every planned period
      - Take all (or the first) Overlapping period(s) with a matching bucket id and calculate how much overlap
      - Get a ratio
      - Accumulate the ratios into one day ratio
    - Did you track enough
      - Total time planned and tracked over time in a day
    - Total All three into a day score
**** Use contribution chart
**** Have a breakdown for selected day 
     - Shows all three scores for the day
     - Will need a day selection component (same as top bar or actually in the top bar?)
**** Add to top bar for day_planning 
**** Convenience 
     - Export scores as json/csv
     - Go to best/worst day
*** BLOCKED Publish to beta track
    :PROPERTIES:
    :ID:       89a5fd42-8f70-4520-bb98-c20fe01169a7
    :END:
    :LOGBOOK:
    CLOCK: [2020-01-12 Sun 17:18]--[2020-01-12 Sun 17:26] =>  0:08
    CLOCK: [2020-01-01 Wed 16:29]--[2020-01-01 Wed 16:32] =>  0:03
    CLOCK: [2020-01-01 Wed 15:28]--[2020-01-01 Wed 15:28] =>  0:00
    :END:
**** Make sure the app runs on the ios simulator 
     - [ ] Set up simulator on macbook
     - [ ] Try installing the client [[https://docs.expo.io/versions/latest/workflow/ios-simulator/#how-do-i-force-an-update-to][with this force update]]
**** Decide on release tag convention 
**** Upload to test flight in app store
     - [ ] Set up an apple developer account
     - [ ] Set up an itunes project
     - [ ] Make an expo build (let expo handle all certificates)
     - [ ] Upload the build to test flight
**** Upload to testing track play store  
     :LOGBOOK:
     CLOCK: [2020-01-13 Mon 19:00]--[2020-01-13 Mon 19:23] =>  0:23
     :END:
     - [X] Set up play store account
     - [ ] Set up a play store project
*** BLOCKED Supporting tasks for beta launch
**** Rebrand to time sink ???
     - [ ] Do a google adds test
       - [ ] Make a simple add that can be run with "time sink" and "time align"
     - [ ] Buy domain
     - [ ] Change app package name
     - [ ] Change repo name
**** Other
     - [ ] Publish static site
     - [ ] Add intro guide
     - [ ] Add readme to repo
     - [ ] Set license in repo
** DOSUB Release to strangers [0/1]
*** BLOCKED Gather friend analytics and inputs
** DOSUB Eventually [0/33]
   :PROPERTIES:
   :ID:       0eb2b451-f3bc-4609-81b6-37c69e74efe6
   :END:
*** TODO Replace top bar with appbar 
    https://callstack.github.io/react-native-paper/appbar-header.html
*** TODO Have a better dark scheme 
    Align it with google calendar colors
*** TODO Border radius on bottom sheet 
    Only the ~render-content~ section of the bottom sheet is affected by the ~border-radius~ prop.
    The content section has a less perform ant gesture handler setup.
    The header works fine, it likely has a single PH gesture for swiping the bottom sheet that doesn't noticeably interfere with the tap gestures on the buttons in the header.
    The content sections has more gesture handlers for scrolling.
    Even when disabling ~enabled-inner-scrolling~ the problem persisted (this also seemed to remove border radius).
    Attempted to add ~border-radius~ and ~:overflow "hidden"~ to the ~surface~ of the component being used for the header but it wouldn't render the border radius.
    There may be a solution in the form of ~inner-gesture-handler-refs~ and [[https://software-mansion.github.io/react-native-gesture-handler/docs/interactions.html#simultaneous-recognition][Simulatneous recognition]].
*** TODO Remove save butons 
      - Have update form automatically save
*** TODO Set up jump-to to switch date 
   Can't just throw it into the on-press because it will be a race condition with scroll-to.
   The scroll-to will need to be moved to a side effect.
*** TODO Change date picker to match theme
**** Attempt to update date picker component in order to change colors
    Attempted to update to "react-native-modal-datetime-picker": "^8.1.2".
    Using expo install react-native-modal-datetime-picker @react-native-community/datetimepicker.
    It just didn't display.
    Attempted swapping react-native-datetime-picker with @react-native-community/datetimepicker.
    But that was starting to get too time intensive.
    
    The problem may have been that the buttons were not triggering on-press in the emulator unless I held it for a second.
    Might be some performance/emulator thing.
     
    Also it doesn't seem like it is https://stackoverflow.com/a/55634504 possible to update the date picker component colors without ejecting.
    Because the date picker relies on some android level theme settings.
    
    Might have to make a custom date/time picker component.
    I really like this one https://github.com/jarvisluong/react-native-picker-js although it may be too old.
*** TODO Figure out why some edits to components don't update with live reload 
*** TODO Display comp doesn't fit on some narrow screens 
    :PROPERTIES:
    :ID:       a6198af8-c14a-4fc2-bc02-34074e7f1bc1
    :END:
*** TODO Resolve differences between display references and code symbols 
    :PROPERTIES:
    :ID:       7040b743-35c8-4543-8b56-501f666863a6
    :END:
    patterns -> templates
    templates -> not referred to
    buckets -> groups
    periods -> not referred to
    actual -> actual
    planned -> planned
    Either make a mapping in the README or refactor names in code
*** TODO Explore ways to make theme switcher 
    https://callstack.github.io/react-native-paper/theming.html#using-the-theme-in-your-own-components
    #+begin_comment
    This is from the first attempt at theme switching
    - [X] Attempted to put a toggle in app-db
       - [X] Chose a light or dark theme based on state at the provider level of component tree
       - [X] Realized there was a bunch of theme usages outside of the provider/component tree theme object
       - [X] Tried to refactor all of those usages to call a function and provide the /mode/ from state
         - [X] It got too ugly
    #+end_comment
*** TODO Fix time comp for negative or over 24 hour values for template start/stop
    It should show the value and allow the users to select values before or after the pattern "day".
*** TODO Figure out why creating a pattern with a period >24 hours defaults to 45 minute duration 
*** TODO CSV export
    https://www.npmjs.com/package/react-csv
*** TODO Add Calendar integration
    :PROPERTIES:
    :Effort:   10:00
    :Confidence: 60
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-17 Tue 18:34]--[2019-09-17 Tue 18:39] =>  0:05
    :END:
https://docs.expo.io/versions/latest/sdk/calendar/
- [ ] Sync button to pull in calendars from system
- [ ] Calendar list
- [ ] Add import to bucket option
- [ ] Enabled option on each calendar item
- [ ] Auto add options under each enabled item
  - [ ] Planned
  - [ ] Actual
- [ ] Calendar reference to templates
- [ ] Calendar reference to periods
- [ ] Calendars enabled and auto add options to each Bucket
- [ ] Form components to link periods to calendar events
- [ ] Form components to link templates to calendar events
*** TODO Add payment option to vote for features  
    Air table integration for features list.
    First option is to select a feature that already exists.
    Second option is to create a new feature request. (rate limit this)
    Then there is an option to vote with $.
    When a successful payment is processed send a request to update the dollar amount in the feature list.
    https://docs.expo.io/versions/latest/sdk/payments/#using-the-payments-sdk
*** TODO Add prescribed handler tests 
    :PROPERTIES:
    :WORK:     5
    :VALUE:    13
    :END:

    https://github.com/day8/re-frame/blob/master/docs/Testing.md
*** TODO Add subscription tests
    :PROPERTIES:
    :WORK:     5
    :VALUE:    13
    :END:
    https://github.com/day8/re-frame/blob/master/docs/Testing.md
*** TODO Multiple play timers
    :PROPERTIES:
    :VALUE:    8
    :WORK:     5
    :END:
   Stacked play indicators in bottom sheet.
   +Top+ Bottom is the selected edit with either a play or stop indicator with color. 
   Each level below that is a stop bottom for each playing item.
   Dynamic snap to points based on how many items in play.
   FAB does not have stop indicator anymore.
   Deslection by "closing" bottom sheet while still being able to see in play stop buttons.
   Can header and dynamic snap positions be used to achieve this? 
   Add notifications for "forgotten" timers. Identify forgotten timers based on average time for a period in the same bucket.
*** TODO Add selected start stop indicators (now indicator style)
    :PROPERTIES:
    :VALUE:    5
    :WORK:     2
    :END:
*** TODO Add geofencing triggers on buckets 
*** TODO Add locked period mechanism
    :PROPERTIES:
    :Effort:   8:00
    :Confidence: 65
    :END:
When using the transform arrows to move things around the other periods (in the day?) should get pushed unless locked.
Have a lock / unlock all button.
*** TODO Mobile friendly data editor
    :PROPERTIES:
    :Effort:   8:00
    :Confidence: 75
    :END:
    :LOGBOOK:
    CLOCK: [2019-08-08 Thu 21:25]--[2019-08-08 Thu 22:56] =>  1:31
    CLOCK: [2019-08-08 Thu 19:42]--[2019-08-08 Thu 20:42] =>  1:00
    :END:
https://gist.github.com/jgoodhcg/ed3cb0b51f117553e2b04ca62946b68d
#+begin_src markdown
Possibly include [A rich text editor](https://www.npmjs.com/package/react-native-cn-richtext-editor) and enable fuzzy search with [fusejs](https://fusejs.io/)
  - A fuse index would be persisted in state and updated for any relevant re-frame events
  - This could be a stop gap solution for a mobile edn/json editor component or an additional way to enrich entities
#+end_src
*** TODO Checklists
    :PROPERTIES:
    :Effort:   6:00
    :Confidence: 65
    :END:
- [ ] Add basic data to spec template
- [ ] Add basic data to spec period
- [ ] Create components for forms
  - [ ] Period
  - [ ] Period compact (modal?)
  - [ ] Template
  - [ ] Template compact (modal?)
  - [ ] Create complete state indicator
*** TODO Notifications (local)
    :PROPERTIES:
    :Effort:   4:00
    :Confidence: 80
    :VALUE:    20
    :WORK:     5
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-12 Tue 19:27]--[2019-11-12 Tue 19:28] =>  0:01
    CLOCK: [2019-11-11 Mon 18:59]--[2019-11-11 Mon 18:59] =>  0:00
    CLOCK: [2019-11-11 Mon 18:10]--[2019-11-11 Mon 18:59] =>  0:49
    CLOCK: [2019-07-27 Sat 17:01]--[2019-07-27 Sat 17:54] =>  0:53
    :END:
- [[https://docs.expo.io/versions/latest/sdk/notifications/#notificationsschedulelocalnotificationasynclocalnotification-schedulingoptions][Schedule local notifications]]
- [[https://docs.expo.io/versions/latest/sdk/notifications/#subscribing-to-notifications][Listen for notifications]]
- [X] Test a local notification
- [ ] Schedule a notification side effect on planned period creation
  - [ ] Add period handler
  - [ ] Apply pattern handler
- [ ] Register a listener to navigate to day
*** TODO Markov chain prediction
    :PROPERTIES:
    :Effort:   16:00
    :Confidence: 30
    :END:
*** TODO Queue page
    :PROPERTIES:
    :Effort:   10:00
    :Confidence: 50
    :END:
**** TODO Add queue definition to app-db
- [ ] queue definition
  - Include priority?
- [ ] ~:queue~ key under ~:bucket~
**** TODO Add queue form
**** TODO Add queue list
**** TODO Add conversion to planned period function
*** TODO Calendar Page
    :PROPERTIES:
    :Effort:   30:00
    :Confidence: 50
    :END:
*** TODO Optional offline analytics
    :PROPERTIES:
    :Effort:   4:00
    :Confidence: 25
    :END:
*** TODO Unpin react svg lib version
     https://github.com/indiespirit/react-native-chart-kit/issues/200#issuecomment-550245684
*** TODO Handle time zone changes 
*** TODO Refactor names 
    - buckets -> groups
    - patterns -> plan
    - time-align -> time-sink
*** TODO Look into siri shortcuts with expo 
    Might need to submit this as a feature for expo
*** TODO Use react-native-router-flux
    Better drawer and navigation experience
    https://github.com/aksonov/react-native-router-flux/blob/master/examples/expo/navigation/AppNavigator.js#L76
** Dreams
- Data includes periods/templates/pattern "generated from info" for reports of usage
- Meta data (with mobile friendly editor) on all entities
- [[https://practicalli.github.io/spacemacs/improving-code/linting/][Linting]]
- Fully namespaced keys only
- DRY up /all/ spectre paths
- Spec everything
- Unit test every function (or handlers, subs, helpers)
- Accessibility
- Energy meter
- Advanced notifications with interaction
- [[https://stackoverflow.com/questions/46680890/react-native-how-to-scroll-a-scrollview-to-a-given-location-after-navigation-f][better scrolling]]
- [[https://docs.expo.io/versions/v33.0.0/react-native/performance/][Optimize performance]]
- Refactor subscriptions to use signal graph pattern
- Refactor views to be very thin (no operations)
- Use animation api for state indication
- All start timestamps end at 45 sec and all stop time stamps end at 15 sec to have same minute, for end to end tasks, without overlap
- Fitbit OS integration / companion app
- Move all side effects (scroll To, bottom sheet collapse) to ~reg-fx~ in re-frame
- Use this [[https://github.com/philoskim/debux][debug library]]
- Use fully qualified keywords for handler registrations so that [[https://github.com/oliyh/re-jump.el][this]] jump to library can be utilized (and because it's better)
- Use more of [[https://nicedoc.io/Day8/re-frame/blob/master/docs/External-Resources.md][these things]]
